tiborsimon/embedded-tdd-headers/pic/pic12/pic12f1501_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12F1501_H_
#define _PIC12F1501_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PIR1                          42
#define TMR1IF                        43
#define TMR2IF                        44
#define ADIF                          45
#define TMR1GIF                       46
#define PIR2                          47
#define NCO1IF                        48
#define C1IF                          49
#define PIR3                          50
#define CLC1IF                        51
#define CLC2IF                        52
#define TMR0                          53
#define TMR1L                         54
#define TMR1H                         55
#define T1CON                         56
#define TMR1ON                        57
#define nT1SYNC                       58
#define T1CKPS0                       59
#define T1CKPS                        60
#define T1CKPS1                       61
#define TMR1CS0                       62
#define TMR1CS                        63
#define TMR1CS1                       64
#define T1GCON                        65
#define T1GSS0                        66
#define T1GSS                         67
#define T1GSS1                        68
#define T1GVAL                        69
#define T1GGO_nDONE                   70
#define T1GSPM                        71
#define T1GTM                         72
#define T1GPOL                        73
#define TMR1GE                        74
#define TMR2                          75
#define PR2                           76
#define T2CON                         77
#define T2CKPS0                       78
#define T2CKPS                        79
#define T2CKPS1                       80
#define TMR2ON                        81
#define TOUTPS0                       82
#define T2OUTPS                       83
#define TOUTPS1                       84
#define TOUTPS2                       85
#define TOUTPS3                       86
#define TRISA                         87
#define TRISA0                        88
#define TRISA1                        89
#define TRISA2                        90
#define TRISA3                        91
#define TRISA4                        92
#define TRISA5                        93
#define PIE1                          94
#define TMR1IE                        95
#define TMR2IE                        96
#define ADIE                          97
#define TMR1GIE                       98
#define PIE2                          99
#define NCO1IE                        100
#define C1IE                          101
#define PIE3                          102
#define CLC1IE                        103
#define CLC2IE                        104
#define OPTION_REG                    105
#define PS                            106
#define PS0                           107
#define PS1                           108
#define PS2                           109
#define PSA                           110
#define T0SE                          111
#define TMR0SE                        112
#define T0CS                          113
#define TMR0CS                        114
#define INTEDG                        115
#define nWPUEN                        116
#define PCON                          117
#define nBOR                          118
#define nPOR                          119
#define nRI                           120
#define nRMCLR                        121
#define nRWDT                         122
#define STKUNF                        123
#define STKOVF                        124
#define WDTCON                        125
#define SWDTEN                        126
#define WDTPS                         127
#define WDTPS0                        128
#define WDTPS1                        129
#define WDTPS2                        130
#define WDTPS3                        131
#define WDTPS4                        132
#define OSCCON                        133
#define SCS0                          134
#define SCS                           135
#define SCS1                          136
#define IRCF                          137
#define IRCF0                         138
#define IRCF1                         139
#define IRCF2                         140
#define IRCF3                         141
#define OSCSTAT                       142
#define HFIOFS                        143
#define LFIOFR                        144
#define HFIOFR                        145
#define ADRESL                        146
#define ADRESH                        147
#define ADCON0                        148
#define ADON                          149
#define GO_nDONE                      150
#define GO                            151
#define ADGO                          152
#define CHS0                          153
#define CHS                           154
#define CHS1                          155
#define CHS2                          156
#define CHS3                          157
#define CHS4                          158
#define ADCON1                        159
#define ADPREF                        160
#define ADPREF0                       161
#define ADPREF1                       162
#define ADCS                          163
#define ADFM                          164
#define ADCON2                        165
#define TRIGSEL                       166
#define TRIGSEL0                      167
#define TRIGSEL1                      168
#define TRIGSEL2                      169
#define TRIGSEL3                      170
#define LATA                          171
#define LATA0                         172
#define LATA1                         173
#define LATA2                         174
#define LATA4                         175
#define LATA5                         176
#define CM1CON0                       177
#define C1SYNC                        178
#define C1HYS                         179
#define C1SP                          180
#define C1POL                         181
#define C1OE                          182
#define C1OUT                         183
#define C1ON                          184
#define CM1CON1                       185
#define C1NCH0                        186
#define C1NCH                         187
#define C1NCH1                        188
#define C1NCH2                        189
#define C1PCH                         190
#define C1PCH0                        191
#define C1PCH1                        192
#define C1INTN                        193
#define C1INTP                        194
#define CMOUT                         195
#define MC1OUT                        196
#define BORCON                        197
#define BORRDY                        198
#define BORFS                         199
#define SBOREN                        200
#define FVRCON                        201
#define ADFVR0                        202
#define ADFVR                         203
#define ADFVR1                        204
#define CDAFVR                        205
#define CDAFVR0                       206
#define CDAFVR1                       207
#define TSRNG                         208
#define TSEN                          209
#define FVRRDY                        210
#define FVREN                         211
#define DACCON0                       212
#define DACPSS                        213
#define DACOE2                        214
#define DACOE1                        215
#define DACEN                         216
#define DACCON1                       217
#define DACR0                         218
#define DACR                          219
#define DACR1                         220
#define DACR2                         221
#define DACR3                         222
#define DACR4                         223
#define APFCON                        224
#define NCO1SEL                       225
#define CLC1SEL                       226
#define T1GSEL                        227
#define CWG1ASEL                      228
#define CWG1BSEL                      229
#define ANSA0                         230
#define ANSELA                        231
#define ANSA1                         232
#define ANSA2                         233
#define ANSA4                         234
#define PMADRL                        235
#define PMADRH                        236
#define PMDATL                        237
#define PMDATH                        238
#define PMCON1                        239
#define RD                            240
#define WR                            241
#define WREN                          242
#define WRERR                         243
#define FREE                          244
#define LWLO                          245
#define CFGS                          246
#define PMCON2                        247
#define VREGCON                       248
#define VREGPM                        249
#define WPUA0                         250
#define WPUA                          251
#define WPUA1                         252
#define WPUA2                         253
#define WPUA3                         254
#define WPUA4                         255
#define WPUA5                         256
#define IOCAP                         257
#define IOCAP0                        258
#define IOCAP1                        259
#define IOCAP2                        260
#define IOCAP3                        261
#define IOCAP4                        262
#define IOCAP5                        263
#define IOCAN0                        264
#define IOCAN                         265
#define IOCAN1                        266
#define IOCAN2                        267
#define IOCAN3                        268
#define IOCAN4                        269
#define IOCAN5                        270
#define IOCAF0                        271
#define IOCAF                         272
#define IOCAF1                        273
#define IOCAF2                        274
#define IOCAF3                        275
#define IOCAF4                        276
#define IOCAF5                        277
#define NCO1ACCL                      278
#define NCO1ACC0                      279
#define NCO1ACC1                      280
#define NCO1ACC2                      281
#define NCO1ACC3                      282
#define NCO1ACC4                      283
#define NCO1ACC5                      284
#define NCO1ACC6                      285
#define NCO1ACC7                      286
#define NCO1ACCH                      287
#define NCO1ACC8                      288
#define NCO1ACC9                      289
#define NCO1ACC10                     290
#define NCO1ACC11                     291
#define NCO1ACC12                     292
#define NCO1ACC13                     293
#define NCO1ACC14                     294
#define NCO1ACC15                     295
#define NCO1ACCU                      296
#define NCO1ACC16                     297
#define NCO1ACC17                     298
#define NCO1ACC18                     299
#define NCO1ACC19                     300
#define NCO1INCL                      301
#define NCO1INC0                      302
#define NCO1INC1                      303
#define NCO1INC2                      304
#define NCO1INC3                      305
#define NCO1INC4                      306
#define NCO1INC5                      307
#define NCO1INC6                      308
#define NCO1INC7                      309
#define NCO1INCH                      310
#define NCO1INC8                      311
#define NCO1INC9                      312
#define NCO1INC10                     313
#define NCO1INC11                     314
#define NCO1INC12                     315
#define NCO1INC13                     316
#define NCO1INC14                     317
#define NCO1INC15                     318
#define NCO1CON                       319
#define N1PFM                         320
#define N1POL                         321
#define N1OUT                         322
#define N1OE                          323
#define N1EN                          324
#define NCO1CLK                       325
#define N1CKS                         326
#define N1CKS0                        327
#define N1CKS1                        328
#define N1PWS0                        329
#define N1PWS                         330
#define N1PWS1                        331
#define N1PWS2                        332
#define PWM1DCL                       333
#define PWM1DCL0                      334
#define PWM1DCL1                      335
#define PWM1DCH                       336
#define PWM1DCH0                      337
#define PWM1DCH1                      338
#define PWM1DCH2                      339
#define PWM1DCH3                      340
#define PWM1DCH4                      341
#define PWM1DCH5                      342
#define PWM1DCH6                      343
#define PWM1DCH7                      344
#define PWM1CON                       345
#define PWM1POL                       346
#define PWM1OUT                       347
#define PWM1OE                        348
#define PWM1EN                        349
#define PWM2DCL0                      350
#define PWM2DCL                       351
#define PWM2DCL1                      352
#define PWM2DCH0                      353
#define PWM2DCH                       354
#define PWM2DCH1                      355
#define PWM2DCH2                      356
#define PWM2DCH3                      357
#define PWM2DCH4                      358
#define PWM2DCH5                      359
#define PWM2DCH6                      360
#define PWM2DCH7                      361
#define PWM2CON                       362
#define PWM2POL                       363
#define PWM2OUT                       364
#define PWM2OE                        365
#define PWM2EN                        366
#define PWM3DCL0                      367
#define PWM3DCL                       368
#define PWM3DCL1                      369
#define PWM3DCH0                      370
#define PWM3DCH                       371
#define PWM3DCH1                      372
#define PWM3DCH2                      373
#define PWM3DCH3                      374
#define PWM3DCH4                      375
#define PWM3DCH5                      376
#define PWM3DCH6                      377
#define PWM3DCH7                      378
#define PWM3CON                       379
#define PWM3POL                       380
#define PWM3OUT                       381
#define PWM3OE                        382
#define PWM3EN                        383
#define PWM4DCL                       384
#define PWM4DCL0                      385
#define PWM4DCL1                      386
#define PWM4DCH0                      387
#define PWM4DCH                       388
#define PWM4DCH1                      389
#define PWM4DCH2                      390
#define PWM4DCH3                      391
#define PWM4DCH4                      392
#define PWM4DCH5                      393
#define PWM4DCH6                      394
#define PWM4DCH7                      395
#define PWM4CON                       396
#define PWM4POL                       397
#define PWM4OUT                       398
#define PWM4OE                        399
#define PWM4EN                        400
#define CWG1DBR0                      401
#define CWG1DBR                       402
#define CWG1DBR1                      403
#define CWG1DBR2                      404
#define CWG1DBR3                      405
#define CWG1DBR4                      406
#define CWG1DBR5                      407
#define CWG1DBF                       408
#define CWG1DBF0                      409
#define CWG1DBF1                      410
#define CWG1DBF2                      411
#define CWG1DBF3                      412
#define CWG1DBF4                      413
#define CWG1DBF5                      414
#define CWG1CON0                      415
#define G1CS0                         416
#define G1CS                          417
#define G1POLA                        418
#define G1POLB                        419
#define G1OEA                         420
#define G1OEB                         421
#define G1EN                          422
#define CWG1CON1                      423
#define G1IS0                         424
#define G1IS                          425
#define G1IS1                         426
#define G1IS2                         427
#define G1ASDLA                       428
#define G1ASDLA0                      429
#define G1ASDLA1                      430
#define G1ASDLB                       431
#define G1ASDLB0                      432
#define G1ASDLB1                      433
#define CWG1CON2                      434
#define G1ASDSCLC2                    435
#define G1ASDSFLT                     436
#define G1ASDSC1                      437
#define G1ARSEN                       438
#define G1ASE                         439
#define CLCDATA                       440
#define MCLC1OUT                      441
#define MCLC2OUT                      442
#define CLC1CON                       443
#define LC1MODE0                      444
#define LC1MODE                       445
#define CLC1CON_LCMODE0               446
#define LC1MODE1                      447
#define CLC1CON_LCMODE1               448
#define CLC1CON_LCMODE2               449
#define LC1MODE2                      450
#define LC1INTN                       451
#define CLC1CON_LCINTN                452
#define LC1INTP                       453
#define CLC1CON_LCINTP                454
#define CLC1CON_LCOUT                 455
#define LC1OUT                        456
#define LC1OE                         457
#define CLC1CON_LCOE                  458
#define LC1EN                         459
#define CLC1CON_LCEN                  460
#define CLC1POL                       461
#define LC1G1POL                      462
#define CLC1POL_G1POL                 463
#define CLC1POL_G2POL                 464
#define LC1G2POL                      465
#define LC1G3POL                      466
#define CLC1POL_G3POL                 467
#define LC1G4POL                      468
#define CLC1POL_G4POL                 469
#define CLC1POL_POL                   470
#define LC1POL                        471
#define CLC1SEL0                      472
#define LC1D1S                        473
#define CLC1SEL0_D1S0                 474
#define LC1D1S0                       475
#define CLC1SEL0_D1S1                 476
#define LC1D1S1                       477
#define CLC1SEL0_D1S2                 478
#define LC1D1S2                       479
#define LC1D2S                        480
#define LC1D2S0                       481
#define CLC1SEL0_D2S0                 482
#define LC1D2S1                       483
#define CLC1SEL0_D2S1                 484
#define LC1D2S2                       485
#define CLC1SEL0_D2S2                 486
#define CLC1SEL1                      487
#define LC1D3S0                       488
#define CLC1SEL1_D3S0                 489
#define LC1D3S                        490
#define LC1D3S1                       491
#define CLC1SEL1_D3S1                 492
#define LC1D3S2                       493
#define CLC1SEL1_D3S2                 494
#define LC1D4S                        495
#define LC1D4S0                       496
#define CLC1SEL1_D4S0                 497
#define LC1D4S1                       498
#define CLC1SEL1_D4S1                 499
#define LC1D4S2                       500
#define CLC1SEL1_D4S2                 501
#define CLC1GLS0                      502
#define CLC1GLS0_D1N                  503
#define LC1G1D1N                      504
#define CLC1GLS0_D1T                  505
#define LC1G1D1T                      506
#define LC1G1D2N                      507
#define CLC1GLS0_D2N                  508
#define LC1G1D2T                      509
#define CLC1GLS0_D2T                  510
#define CLC1GLS0_D3N                  511
#define LC1G1D3N                      512
#define CLC1GLS0_D3T                  513
#define LC1G1D3T                      514
#define CLC1GLS0_D4N                  515
#define LC1G1D4N                      516
#define CLC1GLS0_D4T                  517
#define LC1G1D4T                      518
#define CLC1GLS1                      519
#define CLC1GLS1_D1N                  520
#define LC1G2D1N                      521
