tiborsimon/embedded-tdd-headers/pic/pic12/pic12f1501_tdd.h
#define LC1G2D1T                      522
#define CLC1GLS1_D1T                  523
#define CLC1GLS1_D2N                  524
#define LC1G2D2N                      525
#define LC1G2D2T                      526
#define CLC1GLS1_D2T                  527
#define CLC1GLS1_D3N                  528
#define LC1G2D3N                      529
#define LC1G2D3T                      530
#define CLC1GLS1_D3T                  531
#define CLC1GLS1_D4N                  532
#define LC1G2D4N                      533
#define LC1G2D4T                      534
#define CLC1GLS1_D4T                  535
#define CLC1GLS2                      536
#define CLC1GLS2_D1N                  537
#define LC1G3D1N                      538
#define LC1G3D1T                      539
#define CLC1GLS2_D1T                  540
#define LC1G3D2N                      541
#define CLC1GLS2_D2N                  542
#define LC1G3D2T                      543
#define CLC1GLS2_D2T                  544
#define CLC1GLS2_D3N                  545
#define LC1G3D3N                      546
#define LC1G3D3T                      547
#define CLC1GLS2_D3T                  548
#define LC1G3D4N                      549
#define CLC1GLS2_D4N                  550
#define LC1G3D4T                      551
#define CLC1GLS2_D4T                  552
#define CLC1GLS3                      553
#define LC1G4D1N                      554
#define CLC1GLS3_G4D1N                555
#define LC1G4D1T                      556
#define CLC1GLS3_G4D1T                557
#define CLC1GLS3_G4D2N                558
#define LC1G4D2N                      559
#define CLC1GLS3_G4D2T                560
#define LC1G4D2T                      561
#define LC1G4D3N                      562
#define CLC1GLS3_G4D3N                563
#define LC1G4D3T                      564
#define CLC1GLS3_G4D3T                565
#define CLC1GLS3_G4D4N                566
#define LC1G4D4N                      567
#define CLC1GLS3_G4D4T                568
#define LC1G4D4T                      569
#define CLC2CON                       570
#define LC2MODE0                      571
#define LC2MODE                       572
#define CLC2CON_LCMODE0               573
#define LC2MODE1                      574
#define CLC2CON_LCMODE1               575
#define LC2MODE2                      576
#define CLC2CON_LCMODE2               577
#define LC2INTN                       578
#define CLC2CON_LCINTN                579
#define LC2INTP                       580
#define CLC2CON_LCINTP                581
#define CLC2CON_LCOUT                 582
#define LC2OUT                        583
#define LC2OE                         584
#define CLC2CON_LCOE                  585
#define CLC2CON_LCEN                  586
#define LC2EN                         587
#define CLC2POL                       588
#define LC2G1POL                      589
#define CLC2POL_G1POL                 590
#define LC2G2POL                      591
#define CLC2POL_G2POL                 592
#define LC2G3POL                      593
#define CLC2POL_G3POL                 594
#define LC2G4POL                      595
#define CLC2POL_G4POL                 596
#define CLC2POL_POL                   597
#define LC2POL                        598
#define CLC2SEL0                      599
#define LC2D1S0                       600
#define CLC2SEL0_D1S0                 601
#define LC2D1S                        602
#define LC2D1S1                       603
#define CLC2SEL0_D1S1                 604
#define LC2D1S2                       605
#define CLC2SEL0_D1S2                 606
#define LC2D2S0                       607
#define LC2D2S                        608
#define CLC2SEL0_D2S0                 609
#define LC2D2S1                       610
#define CLC2SEL0_D2S1                 611
#define LC2D2S2                       612
#define CLC2SEL0_D2S2                 613
#define CLC2SEL1                      614
#define CLC2SEL1_D3S0                 615
#define LC2D3S0                       616
#define LC2D3S                        617
#define LC2D3S1                       618
#define CLC2SEL1_D3S1                 619
#define LC2D3S2                       620
#define CLC2SEL1_D3S2                 621
#define LC2D4S                        622
#define LC2D4S0                       623
#define CLC2SEL1_D4S0                 624
#define LC2D4S1                       625
#define CLC2SEL1_D4S1                 626
#define LC2D4S2                       627
#define CLC2SEL1_D4S2                 628
#define CLC2GLS0                      629
#define LC2G1D1N                      630
#define CLC2GLS0_D1N                  631
#define CLC2GLS0_D1T                  632
#define LC2G1D1T                      633
#define LC2G1D2N                      634
#define CLC2GLS0_D2N                  635
#define CLC2GLS0_D2T                  636
#define LC2G1D2T                      637
#define LC2G1D3N                      638
#define CLC2GLS0_D3N                  639
#define CLC2GLS0_D3T                  640
#define LC2G1D3T                      641
#define LC2G1D4N                      642
#define CLC2GLS0_D4N                  643
#define CLC2GLS0_D4T                  644
#define LC2G1D4T                      645
#define CLC2GLS1                      646
#define CLC2GLS1_D1N                  647
#define LC2G2D1N                      648
#define CLC2GLS1_D1T                  649
#define LC2G2D1T                      650
#define CLC2GLS1_D2N                  651
#define LC2G2D2N                      652
#define CLC2GLS1_D2T                  653
#define LC2G2D2T                      654
#define LC2G2D3N                      655
#define CLC2GLS1_D3N                  656
#define LC2G2D3T                      657
#define CLC2GLS1_D3T                  658
#define LC2G2D4N                      659
#define CLC2GLS1_D4N                  660
#define LC2G2D4T                      661
#define CLC2GLS1_D4T                  662
#define CLC2GLS2                      663
#define LC2G3D1N                      664
#define CLC2GLS2_D1N                  665
#define CLC2GLS2_D1T                  666
#define LC2G3D1T                      667
#define CLC2GLS2_D2N                  668
#define LC2G3D2N                      669
#define LC2G3D2T                      670
#define CLC2GLS2_D2T                  671
#define CLC2GLS2_D3N                  672
#define LC2G3D3N                      673
#define CLC2GLS2_D3T                  674
#define LC2G3D3T                      675
#define CLC2GLS2_D4N                  676
#define LC2G3D4N                      677
#define LC2G3D4T                      678
#define CLC2GLS2_D4T                  679
#define CLC2GLS3                      680
#define LC2G4D1N                      681
#define CLC2GLS3_G4D1N                682
#define CLC2GLS3_G4D1T                683
#define LC2G4D1T                      684
#define CLC2GLS3_G4D2N                685
#define LC2G4D2N                      686
#define LC2G4D2T                      687
#define CLC2GLS3_G4D2T                688
#define CLC2GLS3_G4D3N                689
#define LC2G4D3N                      690
#define CLC2GLS3_G4D3T                691
#define LC2G4D3T                      692
#define LC2G4D4N                      693
#define CLC2GLS3_G4D4N                694
#define CLC2GLS3_G4D4T                695
#define LC2G4D4T                      696
#define BSR_ICDSHAD                   697
#define STATUS_SHAD                   698
#define C_SHAD                        699
#define DC_SHAD                       700
#define Z_SHAD                        701
#define WREG_SHAD                     702
#define BSR_SHAD                      703
#define PCLATH_SHAD                   704
#define FSR0L_SHAD                    705
#define FSR0H_SHAD                    706
#define FSR1L_SHAD                    707
#define FSR1H_SHAD                    708
#define STKPTR                        709
#define TOSL                          710
#define TOSH                          711

#endif // _PIC12F1501_H_
